{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c412bb87",
   "metadata": {},
   "source": [
    "# Алгоритмы и структуры данных в языке Python\n",
    "\n",
    "# Тема 4. Функции\n",
    "\n",
    "\n",
    "# Домашнее задание 8\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "016c3788",
   "metadata": {},
   "source": [
    "<p style=\"font-size:125%\">Задание 1. Сумма вклада</p>\n",
    "\n",
    "Имеется 2 банка. Первый банк ежемесячно начисляет 1.1% от первоначально вложенной суммы (простые проценты). Второй банк ежемесячно начисляет 1% от накопленной к этому моменту суммы (сложные проценты). В каждый из банков в месяц 0 (начальный момент) положили 100 000 руб. Напишите программу, которая выводит на экран в виде таблицы, накопленные в этих банках суммы для 24 месяцев. Определите в программе и выведите на экран в какой банк выгоднее вложить деньги на 1 год и на 2 года."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "62855113",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 101100.0 101000.0\n",
      "2 102200.0 102000.0\n",
      "3 103300.0 103000.0\n",
      "4 104400.0 104000.0\n",
      "5 105500.0 105000.0\n",
      "6 106600.0 106000.0\n",
      "7 107700.0 107000.0\n",
      "8 108800.0 108000.0\n",
      "9 109900.0 109000.0\n",
      "10 111000.0 110000.0\n",
      "11 112100.0 111000.0\n",
      "12 113200.0 112000.0\n",
      "13 114300.0 113000.0\n",
      "14 115400.0 114000.0\n",
      "15 116500.0 115000.0\n",
      "16 117600.0 116000.0\n",
      "17 118700.0 117000.0\n",
      "18 119800.0 118000.0\n",
      "19 120900.0 119000.0\n",
      "20 122000.0 120000.0\n",
      "21 123100.0 121000.0\n",
      "22 124200.0 122000.0\n",
      "23 125300.0 123000.0\n",
      "24 126400.0 124000.0\n",
      "25 127500.0 125000.0\n",
      "На 24 месяцев выгоднее положить в 1 банк\n",
      "На 12 месяцев выгоднее положить в 1 банк\n"
     ]
    }
   ],
   "source": [
    "num1 = 100000\n",
    "num2 = 100000\n",
    "\n",
    "def vklad(k1, k2, month=1):\n",
    "    k1+=100000.0*0.011\n",
    "    k2+=num2*0.01\n",
    "    print(month, k1, k2)\n",
    "    if month<=24:\n",
    "        vklad(k1, k2, month+1)\n",
    "    \n",
    "    if month==12 or month==24:\n",
    "        if k1>k2:\n",
    "            print(f\"На {month} месяцев выгоднее положить в 1 банк\")\n",
    "        else:\n",
    "            print(f\"На {month} месяцев выгоднее положить в 2 банк\")\n",
    "vklad(num1, num2)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
